In [9]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [12]:
# Files to load, Read the files, Create dataframe
city_data_df = pd.read_csv("/Users/randypants/Desktop/Data/Module5_Matplot/PyBer_analysis/resources/city_data.csv")
city_data_df

ride_data_df = pd.read_csv("/Users/randypants/Desktop/Data/Module5_Matplot/PyBer_analysis/resources/ride_data.csv")
ride_data_df

                    city           date   fare       ride_id
0     Lake Jonathanshire  1/14/19 10:14  13.83  5.739410e+12
1     South Michelleport   3/4/19 18:24  30.24  2.343910e+12
2     Port Samanthamouth   2/24/19 4:29  33.44  2.005070e+12
3             Rodneyfort  2/10/19 23:22  23.44  5.149250e+12
4             South Jack    3/6/19 4:28  34.58  3.908450e+12
...                  ...            ...    ...           ...
2370         Michaelberg  4/29/19 17:04  13.38  8.550370e+12
2371     Lake Latoyabury   1/30/19 0:05  20.76  9.018730e+12
2372         North Jaime  2/10/19 21:03  11.11  2.781340e+12
2373        West Heather   5/7/19 19:22  44.94  4.256850e+12
2374          Newtonview  4/25/19 10:20  55.84  9.990580e+12

[2375 rows x 4 columns]

In [15]:
# Get the column count
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [16]:
# Get the columns and the rows that are not null.
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [17]:
# Get the data types of each column.
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [18]:
# Get the unique values of the type of city.
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [21]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Rural")

18

In [22]:
# Get the column count
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [23]:
# Get the columns and the rows that are not null.
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [24]:
# Get the data types of each column.
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id    float64
dtype: object

In [25]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

                 city           date   fare       ride_id  driver_count   type
0  Lake Jonathanshire  1/14/19 10:14  13.83  5.739410e+12             5  Urban
1  South Michelleport   3/4/19 18:24  30.24  2.343910e+12            72  Urban
2  Port Samanthamouth   2/24/19 4:29  33.44  2.005070e+12            57  Urban
3          Rodneyfort  2/10/19 23:22  23.44  5.149250e+12            34  Urban
4          South Jack    3/6/19 4:28  34.58  3.908450e+12            46  Urban